# AdjustCurveTooShort Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AdjustCurveTooShort Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
AdjustCurve is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdjustCurveTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdjustCurveTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdjustCurveTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace